{
    "websites": [
        {
            "id": 1,
            "title": "Casperetlulu",
            "description": "Site web construit en collaboration avec Aurélie Thiré pour l'association Casperetlulu en bénévolat. Cette association recueille des chats errants ou abandonnés et leur cherche une famille adoptive. Ce site a pour objectif de les rendre visibles et ainsi faciliter leur adoption ou la récolte de dons. C'est un peu une sorte de catalogue avec un compte admin accessible uniquement par la présidente qui peut ajouter, modifier ou supprimer des posts de chats ou d'évènements. ",
            "domain": [
                "React/Javascript",
                "Tous",
                "Backend",
                "MongoDB"
            ],
            "category": "Site web professionnel",
            "gitHub": "",
            "site": "https://www.casperetlulu.fr",
            "picture": "banner_cats2.jpg",
            "date": "10-2023",
            "competences": [
                "Création du backend avec MongoDB et Express.js",
                "Intégration/développement du site avec JavaScript et REACT",
                "API REST",
                "Authentification",
                "Redux"
            ]
        },
        {
            "id": 2,
            "title": "OhMyFood",
            "description": "Ohmyfood est une jeune startup qui voudrait s'imposer sur le marché de la restauration. Ce projet consiste à développer un site responsive en “mobile first” uniquement côté front-end, amélioré avec des animations CSS, qui répertorie les menus de restaurants gastronomiques. A partir d'une maquette, le site est développé pour mobile, tablette et desktop.",
            "domain": [
                "HTML5/CSS",
                "Tous"
            ],
            "category": "Site témoin",
            "gitHub": "https://github.com/olouisa/Projet-4.git",
            "site": "https://olouisa.github.io/Projet-4/",
            "picture": "ohMyFoodProject.png",
            "date": "12-2022",
            "competences": [
                "Intégrer une maquette en mobile-first",
                "Versionner son projet avec Git et Github",
                "Mettre en œuvre des animations CSS"
            ]
        },
      
        {
            "id": 4,
            "title": "Booki",
            "description": "Booki est une entreprise qui souhaite développer un site Internet permettant aux usagers de trouver des hébergements et des activités dans la ville de leur choix. La mission de ce projet est d'intégrer l'interface du site en HTML CSS. A partir de maquettes, le site est responsive et entièrement développé pour desktop, tablette et mobile. ",
            "domain": [
                "HTML5/CSS",
                "Tous"
            ],
            "category": "Site témoin",
            "gitHub": "https://github.com/olouisa/bookiproject",
            "site": "https://olouisa.github.io/bookiproject/",
            "picture": "bookiProject.png",
            "date": "11-2022",
            "competences": [
                "Implémenter une interface responsive avec HTML et CSS",
                "Installer un environnement de développement front-end",
                "Intégrer du contenu conformément à une maquette avec HTML et CSS"
            ]
        }
    ],
    "projects": [
        {
            "id": 1,
            "title": "Argent Bank",
            "description": "Argent Bank est une nouvelle banque en ligne souhaitant percer dans le secteur bancaire. La mission du projet est de créer une application complète en React, avec une authentification utilisateur. Redux est utilisé pour gérer l'authentification et les modifications du profil utilisateur. La phase concernant les transactions et leurs fonctionnalités étant encore en cours de conception dans ce projet, il a également été nécessaire de proposer une façon de modéliser les routes de l'API côté backend afin que l'utilisateur puisse consulter, ou modifier des informations. Pour ce faire, dans le document Swagger, la description des routes API proposées pour les manipulations sur les transactions a été rédigée et ajoutée. Enfin, une prise en compte des principes du Green Code, par l'optimisation des images et la création de composants réutilisables, se fait lors de l'intégration",
            "domain": [
                "React/Javascript",
                "Tous"
            ],
            "gitHub": "https://github.com/olouisa/ArgentBank-website.git",
            "site": "",
            "picture": "argentbankimg.png",
            "date": "06-2023",
            "competences": [
                "Afficher les données du back end sur l'interface via des appels API",
                "Configurer des routes API pour la communication client / serveur",
                "Implémenter la gestion des données avec Redux pour assurer le fonctionnement du front"
            ]
        },
      
        {
            "id": 4,
            "title": "Kasa",
            "description": "Le site de Kasa a été codé il y a plus de 10 ans avec un code legacy important. La mission de ce projet était une refonte totale pour passer à une stack complète en JavaScript et React côté front-end. Le site est responsive et entièrement développé avec React à partir de maquettes.",
            "domain": [
                "React/Javascript",
                "Tous"
            ],
            "gitHub": "https://github.com/olouisa/projet-8.git",
            "site": "",
            "picture": "kasaproject.png",
            "date": "04-2023",
            "competences": [
                "Développer des éléments de l'interface d'un site web grâce à des composants React",
                "Initialiser une application avec Create React App",
                "Configurer la navigation entre les pages de l'application avec React Router"
            ]
        }
    ],
    "categories": [
        "HTML5/CSS",
        "React/Javascript",
        "MongoDB",
        "Backend",
        "Tous"
    ],
    "competences": [
        {
            "id": 1,
            "stack": "HTML/5",
            "picture": "html.png"
        },
        {
            "id": 2,
            "stack": "CSS",
            "picture": "css.png"
        },
        {
            "id": 3,
            "stack": "JavaScript",
            "picture": "javascript.png"
        },
        {
            "id": 4,
            "stack": "React",
            "picture": "react.png"
        },
        {
            "id": 5,
            "stack": "MongoDB/Express.js",
            "picture": "mongodb.png"
        },
        {
            "id": 6,
            "stack": "Redux",
            "picture": "redux.png"
        },
        {
            "id": 7,
            "stack": "Node.js",
            "picture": "node-js.png"
        }
    ],
        
               
        
    "carrousel": [
        "banner_cats2.jpg",
        "ohMyFood3.png",
        "booki2.png"
    ]
}